<a href="https://colab.research.google.com/github/bhupinbaral25/minor_project_2/blob/main/1_Cleaning_marketing_data.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
#Upload csv to colab
# from google.colab import files
# uploaded = files.upload()

**Content**

AcceptedCmp1 - 1 if customer accepted the offer in the 1st campaign, 0 otherwise

AcceptedCmp2 - 1 if customer accepted the offer in the 2nd campaign, 0 otherwise

AcceptedCmp3 - 1 if customer accepted the offer in the 3rd campaign, 0 otherwise

AcceptedCmp4 - 1 if customer accepted the offer in the 4th campaign, 0 otherwise

AcceptedCmp5 - 1 if customer accepted the offer in the 5th campaign, 0 otherwise

Response (target) - 1 if customer accepted the offer in the last campaign, 0 otherwise

Complain - 1 if customer complained in the last 2 years

DtCustomer - date of customer’s enrolment with the company

Education - customer’s level of education

Marital - customer’s marital status

Kidhome - number of small children in customer’s household

 Teenhome - number of teenagers in customer’s household

 Income - customer’s yearly household income

MntFishProducts - amount spent on fish products in the last 2 years

MntMeatProducts - amount spent on meat products in the last 2 years

MntFruits - amount spent on fruits products in the last 2 years

MntSweetProducts - amount spent on sweet products in the last 2 years

MntWines - amount spent on wine products in the last 2 years

MntGoldProds - amount spent on gold products in the last 2 years

NumDealsPurchases - number of purchases made with discount


NumCatalogPurchases - number of purchases made using catalogue

NumStorePurchases - number of purchases made directly in stores

NumWebPurchases - number of purchases made through company’s web site

NumWebVisitsMonth - number of visits to company’s web site in the last month

Recency - number of days since the last purchase

In [ ]:
import pandas as pd
df = pd.read_csv('marketing_data.csv')
df.head()

      ID  Year_Birth   Education  ... Response Complain  Country
0   1826        1970  Graduation  ...        1        0       SP
1      1        1961  Graduation  ...        1        0       CA
2  10476        1958  Graduation  ...        0        0       US
3   1386        1967  Graduation  ...        0        0      AUS
4   5371        1989  Graduation  ...        1        0       SP

[5 rows x 28 columns]

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2240 entries, 0 to 2239
Data columns (total 28 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   ID                   2240 non-null   int64
 1   Year_Birth           2240 non-null   int64
 2   Education            2240 non-null   object
 3   Marital_Status       2240 non-null   object
 4    Income              2216 non-null   object
 5   Kidhome              2240 non-null   int64
 6   Teenhome             2240 non-null   int64
 7   Dt_Customer          2240 non-null   object
 8   Recency              2240 non-null   int64
 9   MntWines             2240 non-null   int64
 10  MntFruits            2240 non-null   int64
 11  MntMeatProducts      2240 non-null   int64
 12  MntFishProducts      2240 non-null   int64
 13  MntSweetProducts     2240 non-null   int64
 14  MntGoldProds         2240 non-null   int64
 15  NumDealsPurchases    2240 non-null   int64
 16  NumWebPurchases      2240 non-null   int64
 17  NumCatalogPurchases  2240 non-null   int64
 18  NumStorePurchases    2240 non-null   int64
 19  NumWebVisitsMonth    2240 non-null   int64
 20  AcceptedCmp3         2240 non-null   int64
 21  AcceptedCmp4         2240 non-null   int64
 22  AcceptedCmp5         2240 non-null   int64
 23  AcceptedCmp1         2240 non-null   int64
 24  AcceptedCmp2         2240 non-null   int64
 25  Response             2240 non-null   int64
 26  Complain             2240 non-null   int64
 27  Country              2240 non-null   object
dtypes: int64(23), object(5)
memory usage: 490.1+ KB

In [ ]:
#lowercasing all the headers
df.columns = map(str.lower, df.columns)
# Removing white spaces from the headers
df = df.rename(columns=lambda x: x.strip())
df.head()

      id  year_birth   education  ... response complain  country
0   1826        1970  Graduation  ...        1        0       SP
1      1        1961  Graduation  ...        1        0       CA
2  10476        1958  Graduation  ...        0        0       US
3   1386        1967  Graduation  ...        0        0      AUS
4   5371        1989  Graduation  ...        1        0       SP

[5 rows x 28 columns]

In [ ]:
# dropping not so useful columns
df.drop(['id'], axis=1, inplace =True)
df.drop(['acceptedcmp1'], axis=1, inplace =True)
df.drop(['acceptedcmp2'], axis=1, inplace =True)
df.drop(['acceptedcmp3'], axis=1, inplace =True)
df.drop(['acceptedcmp4'], axis=1, inplace =True)
df.drop(['acceptedcmp5'], axis=1, inplace =True)
df.drop(['response'], axis=1, inplace =True)
df.drop(['complain'], axis=1, inplace =True)
df.drop(['recency'], axis=1, inplace =True)
df.drop(['numwebvisitsmonth'], axis=1, inplace =True)
df.drop(['numdealspurchases'], axis=1, inplace =True)
df.drop(['numcatalogpurchases'], axis=1, inplace =True)
df.drop(['dt_customer'], axis=1, inplace =True)

In [ ]:
# Manipulate differrent columns
df['children_home'] = df['kidhome'] + df['teenhome']
df.drop(['kidhome'], axis=1, inplace =True)
df.drop(['teenhome'], axis=1, inplace =True)

df['mntmeatproducts'] = df['mntmeatproducts'] + df['mntfishproducts']
df.drop(['mntfishproducts'], axis=1, inplace =True)

In [ ]:
# drop_duplicates
df= df.drop_duplicates()
df.head()

   year_birth   education  ... country children_home
0        1970  Graduation  ...      SP             0
1        1961  Graduation  ...      CA             0
2        1958  Graduation  ...      US             1
3        1967  Graduation  ...     AUS             2
4        1989  Graduation  ...      SP             1

[5 rows x 13 columns]

In [ ]:
df.isnull().sum()

year_birth            0
education             0
marital_status        0
income               24
mntwines              0
mntfruits             0
mntmeatproducts       0
mntsweetproducts      0
mntgoldprods          0
numwebpurchases       0
numstorepurchases     0
country               0
children_home         0
dtype: int64

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2186 entries, 0 to 2239
Data columns (total 13 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   year_birth         2186 non-null   int64
 1   education          2186 non-null   object
 2   marital_status     2186 non-null   object
 3   income             2162 non-null   object
 4   mntwines           2186 non-null   int64
 5   mntfruits          2186 non-null   int64
 6   mntmeatproducts    2186 non-null   int64
 7   mntsweetproducts   2186 non-null   int64
 8   mntgoldprods       2186 non-null   int64
 9   numwebpurchases    2186 non-null   int64
 10  numstorepurchases  2186 non-null   int64
 11  country            2186 non-null   object
 12  children_home      2186 non-null   int64
dtypes: int64(9), object(4)
memory usage: 239.1+ KB

In [ ]:
df.memory_usage(deep='True')

Index                 17488
year_birth            17488
education            141029
marital_status       140066
income               147768
mntwines              17488
mntfruits             17488
mntmeatproducts       17488
mntsweetproducts      17488
mntgoldprods          17488
numwebpurchases       17488
numstorepurchases     17488
country              129400
children_home         17488
dtype: int64

In [ ]:
#Converting income to numerical value and converting dt_costumer to datetime
df['income'] = ((df['income'].str.replace('$','')).str.replace(',','')).astype(str).astype(float)
df['income'].dtype
# df['dt_customer'] = pd.to_datetime(df['dt_customer'])
# df.head(10)

dtype('float64')

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2186 entries, 0 to 2239
Data columns (total 13 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   year_birth         2186 non-null   int64
 1   education          2186 non-null   object
 2   marital_status     2186 non-null   object
 3   income             2162 non-null   float64
 4   mntwines           2186 non-null   int64
 5   mntfruits          2186 non-null   int64
 6   mntmeatproducts    2186 non-null   int64
 7   mntsweetproducts   2186 non-null   int64
 8   mntgoldprods       2186 non-null   int64
 9   numwebpurchases    2186 non-null   int64
 10  numstorepurchases  2186 non-null   int64
 11  country            2186 non-null   object
 12  children_home      2186 non-null   int64
dtypes: float64(1), int64(9), object(3)
memory usage: 239.1+ KB

In [ ]:
# Counting the no of categery in any column
print(df.education.value_counts())
print(df.marital_status.value_counts())
print(df.country.value_counts())

Graduation    1098
PhD            473
Master         365
2n Cycle       196
Basic           54
Name: education, dtype: int64
Married     841
Together    569
Single      470
Divorced    225
Widow        74
Alone         3
YOLO          2
Absurd        2
Name: marital_status, dtype: int64
SP     1049
SA      335
CA      265
AUS     159
IND     147
GER     120
US      108
ME        3
Name: country, dtype: int64

In [ ]:
# Converting objects to categories
df['education'] = df['education'].astype('category')
df['marital_status'] = df['marital_status'].astype('category')
df['country'] = df['country'].astype('category')

In [ ]:
df.education.cat.codes

0       2
1       2
2       2
3       2
4       2
       ..
2235    4
2236    0
2237    2
2238    2
2239    4
Length: 2186, dtype: int8

In [ ]:
df.memory_usage(deep='True')

Index                17488
year_birth           17488
education             2663
marital_status        3011
income               17488
mntwines             17488
mntfruits            17488
mntmeatproducts      17488
mntsweetproducts     17488
mntgoldprods         17488
numwebpurchases      17488
numstorepurchases    17488
country               2981
children_home        17488
dtype: int64

In [ ]:
df.head()

   year_birth   education  ... country  children_home
0        1970  Graduation  ...      SP              0
1        1961  Graduation  ...      CA              0
2        1958  Graduation  ...      US              1
3        1967  Graduation  ...     AUS              2
4        1989  Graduation  ...      SP              1

[5 rows x 13 columns]

In [ ]:
from sklearn.preprocessing import LabelEncoder
le=LabelEncoder()
df['education'] =le.fit_transform(df['education'])
df['marital_status'] =le.fit_transform(df['marital_status'])
df['country'] =le.fit_transform(df['country'])

In [ ]:
import numpy as np
df['income'] = df['income'].fillna(0).astype(np.int64)

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2186 entries, 0 to 2239
Data columns (total 13 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   year_birth         2186 non-null   int64
 1   education          2186 non-null   int64
 2   marital_status     2186 non-null   int64
 3   income             2186 non-null   int64
 4   mntwines           2186 non-null   int64
 5   mntfruits          2186 non-null   int64
 6   mntmeatproducts    2186 non-null   int64
 7   mntsweetproducts   2186 non-null   int64
 8   mntgoldprods       2186 non-null   int64
 9   numwebpurchases    2186 non-null   int64
 10  numstorepurchases  2186 non-null   int64
 11  country            2186 non-null   int64
 12  children_home      2186 non-null   int64
dtypes: int64(13)
memory usage: 239.1 KB

Name: education, dtype: int64(codes)

Graduation    2

PhD           4

Master        3

2n Cycle      0

Basic         1


Name: marital_status, dtype: int64(codes)

Married       3

Together      5

Single        4

Divorced      2

Widow         6

Alone         1

YOLO          7

Absurd        0


Name: country, dtype: int64(codes)

SP            6

SA            5

CA            1

AUS           0

IND           3

GER           2

US            7

ME            4

In [ ]:
df.to_csv('cleaned_marketing_data.csv') 
files.download('cleaned_marketing_data.csv')